Repository: chahna-goldberg/hav
Catalog: module/Application/language/*.po
Languages: he_il

source: Username
he_il: שם משתמש

source: Email
he_il: כתובת דואר אלקטרוני

source: New Email
he_il: דואר אלקטרוני חדש

source: Verify New Email
he_il: בדיקת דואר אלקטרוני חדש

source: Display Name
he_il: שם כינוי

source: Password
he_il: סיסמה

source: Password Verify
he_il: בדיקת סיסמה

source: Current Password
he_il: סיסמה נוכחית

source: Verify New Password
he_il: בדיקת סיסמה חדשה

source: New Password
he_il: סיסמה חדשה

source: Please type the following text
he_il: נא הקלד את המלל הזה

source: Submit
he_il: שגר

source: Sign In
he_il: התחברות למערכת

source: Register
he_il: הרשמה

source: No record matching the input was found
he_il: לא נמצאה התאמה עם מה שהוזן

source: A record matching the input was found
he_il: נמצאה רשומה תואמת

source: Authentication failed. Please try again.
he_il: זהוי המשתמש נכשל, אנא נסה שוב.

source: Change Email for %s
he_il: החלף דואר אלקטרוני עבור %s

source: Email address changed successfully.
he_il: הדואל הוחלף בהצלחה

source: Unable to update your email address. Please try again.
he_il: עדכון דואר אלקטרוני נכשל, אנא נסה שוב.

source: Change Password for %s
he_il: החלף סיסמה עבור %s

source: Password changed successfully.
he_il: הסיסמה הוחלפה בהצלחה!

source: Unable to update your password. Please try again.
he_il: עדכון הסיסמה נכשל, אנא נסה שוב

source: Hello
he_il: שלום

source: Sign Out
he_il: התנתק מהמערכת

source: Not registered?
he_il: אינך רשום?

source: Sign up!
he_il: הרשם !

source: Registration is disabled
he_il: אין כרגע אפשרות להרשם
